ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0gx218_gx207/TIMB1_1.0.xml
        </group>
    <register id="TIMB1_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="CPU_INT_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="GEN_EVENT_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <group id="TIMB1_CTRREGS" name="TIMB1_CTRREGS" instances="4" offset="0x1100" instaddr="0x100" description="">
        <register id="TIMB1_CTL0" width="32" offset="0x0" description="CTL0 register">
            <bitfield id="EN" description="Counter Enable" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="STARTSEL" description="Selects the source used to start the counter." begin="7" end="4" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="STOPSEL" description="Selects the source used to stop the counter." begin="11" end="8" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="RESETSEL" description="Selects the source used to reset the counter." begin="15" end="12" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="CLKSEL" description="Clock sources" begin="19" end="16" width="4" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="TIMB1_LD" width="32" offset="0x4" description="Counter period register.">
            <bitfield id="VAL" description="Period value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x1" description="Minimum counter value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Maximum counter value"/>
            </bitfield>
        </register>
        <register id="TIMB1_CNT" width="32" offset="0x8" description="Counter register.">
            <bitfield id="VALUE" description="Counter Value" begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        </group>

</module>